hrshygoodness/Luminary-Micro-Library/SimpliciTI-1.1.1/Components/mrfi/smartrf/CC2511/smartrf_CC2511.h
/***************************************************************
 *  SmartRF Studio(tm) Export
 *
 *  Radio register settings specifed with C-code
 *  compatible #define statements.
 *
 ***************************************************************/

#ifndef SMARTRF_CC2511_H
#define SMARTRF_CC2511_H

#define SMARTRF_RADIO_CC2511

#define SMARTRF_SETTING_FSCTRL1     0x0A
#define SMARTRF_SETTING_FSCTRL0     0x00
#define SMARTRF_SETTING_FREQ2       0x65
#define SMARTRF_SETTING_FREQ1       0x0A
#define SMARTRF_SETTING_FREQ0       0xAA
#define SMARTRF_SETTING_MDMCFG4     0x1D
#define SMARTRF_SETTING_MDMCFG3     0x55
#define SMARTRF_SETTING_MDMCFG2     0x73
#define SMARTRF_SETTING_MDMCFG1     0x23
#define SMARTRF_SETTING_MDMCFG0     0x55
#define SMARTRF_SETTING_CHANNR      0x03
#define SMARTRF_SETTING_DEVIATN     0x00
#define SMARTRF_SETTING_FREND1      0xB6
#define SMARTRF_SETTING_FREND0      0x10
#define SMARTRF_SETTING_MCSM0       0x10
#define SMARTRF_SETTING_FOCCFG      0x1D
#define SMARTRF_SETTING_BSCFG       0x1C
#define SMARTRF_SETTING_AGCCTRL2    0xC7
#define SMARTRF_SETTING_AGCCTRL1    0x00
#define SMARTRF_SETTING_AGCCTRL0    0xB2
#define SMARTRF_SETTING_FSCAL3      0xEA
#define SMARTRF_SETTING_FSCAL2      0x0A
#define SMARTRF_SETTING_FSCAL1      0x00
#define SMARTRF_SETTING_FSCAL0      0x11
#define SMARTRF_SETTING_TEST2       0x88
#define SMARTRF_SETTING_TEST1       0x31
#define SMARTRF_SETTING_TEST0       0x09
#define SMARTRF_SETTING_PA_TABLE0   0xFE
#define SMARTRF_SETTING_PKTCTRL1    0x04
#define SMARTRF_SETTING_PKTCTRL0    0x05
#define SMARTRF_SETTING_ADDR        0x00
#define SMARTRF_SETTING_PKTLEN      0xFF

#endif

